1. მაღაზიის გაყიდვებისთვის შექმენით ცხრილების სტრუქტურა, რომელშიც ჩაიწერება შემდეგი მონაცემები:

როდის გაიყიდა, რა ნივთი გაიყიდა, რა ერთეულში (კგ, ლიტრი, ცალობით, ყუთობით), რა რაოდენობით, რა ფასში, ვინ იყიდა - სახელი, გვარი, პირადი ნომერი(არააუცილებელი), მყიდველის საკონტაქტო ტელეფონის ნომრები და მეილი 
(გაითვალისწინეთ რომ ერთ კლიენტს შეილება ქონდეს 1 ან რამოდენიმე ნომერი და 1 ან რამოდენიმე მეილი), 
ვინ გაყიდა (თანამშრომელის სახელი, გვარი, პირადი ნომერი).

ამ მონაცემებისთვის შექმენით იმდენი ცხრილი რამდენიც დაგჭირდებათ.

2. დაადეთ ცხრილებს შესაბამისი კავშირები და შეზღუდვები. Primary Key, Foreign Key(s), Unique Key(s), Not Null
ასევე თითოეული ცხრილისთვის შექმენით Primary Key-ს დასაგენერირებელი მიმდევრობა (sequence), რომელიც დაიწყებს გენერაციას 1-დან და გაიზრდება 1-ით.

3. შეიტანეთ ცხრილებში 15 კლიენტის მონაცემები და გაუწერეთ კლოიენტებს საკონტაქტო ნომრები და მეილები 
   შეიტანეთ ცხრილებში 5 თანამშრომელის მონაცემები
   შეიტანეთ ცხრილებში ერთეულების მონაცემები - კგ, გრამი, ლიტრი, ცალი, ყუთი, 
   შეიტანეთ ცხრილებში გაყიდვის შესახებ ინფორმაცია - 20 ჩანაწერი
   
4. შექმენით view რომელიც თქვენს მიერ შექმნილი ცხრილებიდან გადააბამს მონაცემებს და გამოიტანს შემდეგი სახით:

კლიენტის სახელი, კლიენტის გვარი, ნივთი, ერთეული, რაოდენობა, ერთეულის ფასი, ჯამური ფასი, გაყიდვის დრო, თნამშრომლის (გამყიდველის) სახელი, თანამშრომლის (გამყიდველის) გვარი

მაგ.: შოთა, რუსთავლი, Snickers, ცალი, 2, 1.5, 3, 23/11/2018 15:21:25, მორგანი, ფრიმენი

5. დაწერეთ სკრიპტი რეპორტისთვის, რომელიც აჩვენებს ყოველდღიურ გაყიდვების ჯამურ თანხას, გაყიდვების რაოდენობას (რამდენჯერ მოხდა გაყიდვის ფაქტი), 
ჩეკის საშუალო ღირებულებას (ერთ ყიდვაზე გადახდილი თანხის საშუალო მაჩვენებელი), ერთი დღის განმავლობაში რამდენმა განსხვავებულმა კლიენტმა იყიდა (დათვალეთ მხოლოდ ის კლიენტები რომლებიც მითითებულია)
